{"index":{"_index":"reddit"}}
{"title":"Which country in the world suffers most from wage inequality and why?","body":"Shall we discuss this topic in the comments? I'm curious to hear your opinions. I have written my own thoughts below.\r  \n\r  \nMany sources and studies highlight countries like Brazil, South Africa, India, and the United States as standing out in terms of income inequality. Inequality factors in these countries can include high income inequality, challenging working conditions faced by low-wage workers, racial or ethnic discrimination, gender inequality, and social class disparities.\r  \n\r  \nThe causes of income inequality in these countries can be complex and multifaceted. For example, high income inequality can sometimes reflect a wide economic gap between the rich and the poor. Challenging working conditions experienced by low-wage workers can arise from factors such as low job security, low wages, and limited social safety nets. One of the major causes, of course, is poor governance.","url":"https://www.reddit.com/r/business/comments/14eeld2/which_country_in_the_world_suffers_most_from_wage/","comment":"Close your eyes, and you can choose one of the Arab countries that own oil. It will be in the front row. Statistically, I don't have any data. However, I can list the facts that support this idea.\r  \n1- There is a feudal administration, and these princes, the emirs, own almost all of the country's resources. The rich side of the inequality is not only in those countries but also among the richest in the world.\r  \n2- The culture of submissiveness prevents paid employees from organizing. They're only at the mercy of employers for wage increases. The fatalistic social spirit is deprived of the energy to change its life.\r  \n3- Most of the far eastern workers who go to work in these countries are employed by having their passports confiscated. The law doesn't protect you.\r  \n4- There is no need to talk about gender wage inequality. Women have no chance to have a say in their future outside of the workplace. It doesn't matter if women are spouses or siblings or women who work at home. Women have no say at all."}
{"index":{"_index":"reddit"}}
{"title":"Passion","body":"Does your work drive you? Or is it something you separate yourself from?  \n\n\nMost people I know take pieces of themselves and apply them here or there. The aspect of myself that is motherhood is ready to turn on when work is over and my girls are back with me. I flip the switch to become a powerhouse when I sit at my computer, coffee in hand, ready to crank out what is needed.   \n\n\nBut what does it mean to actually live 100% as YOURSELF in this life. No switches needing to be flipped. The passion and focus that is normally fabricated, actually fueling you. Because there is all of a sudden a natural synchronicity between what you are spending most of your days doing to make money in order to support yourself and your family....and what you actually want to spend your time doing.   \n\n\nIf financial freedom opened up its doors for me today I would travel. Create the home environment that I've been dreaming of for years. Write a book. Spend time with my girls and my partner. Revel in the freedom of being able to wake up with the sun and do yoga on my rooftop, needing to rush for no one and nothing. But then, I would get to work.   \n\n\nI love business. I love the mechanics of providing a solution for an existing need. Figuring out the logistics. How incredible would it be to be able to play out your passion without fear of losing your home? Without worrying about how you are going to feed your family, or pay your bills?  \n\n\nMy passion is people. My personal mission in this life is to live out loud, love fervently, and leave a gentle ripple. I want to live my best, happiest, most peaceful life. And if I could spend my working hours doing anything, it would be to facilitate others to do the same - whatever their best life looks like for them.   \n\n\nWhat about you? Are work and passion intertwined? Are you one of the lucky ones settled into the sweet spot of living the life you've always dreamed of, while focusing your attention on the areas that you're most interested in? I want to hear about it, the long winding road that got you there, or the straight path from A to B that led you to living a life of fulfillment. ","url":"https://www.reddit.com/r/business/comments/14ebxti/passion/","comment":"Wow, you and I are the same person. Haha, except you sound much better at disengaging from work to be with your kids, while it's always ruminating for me in the background.\n\nI think my work drives me. Case in point: when I was on maternity leave last year (well, not really, since I run my own business, so I guess it was just time off), I got bored about 3 months in. I started a podcast LOL. I love working. Even if I was financially free, as you said, I would still come back to something that drove me. So my work is my life, and sometimes that's dangerous. I've had 4 businesses. 2 that failed for different reasons, 1 that did well, and 1 that I'm trying to make my full time business right now and transition into it.  Your passion - guiding others to live their best life - is a bit similar to what I do right now in my coaching, though mine is business coaching, and you sound like you want to go more into life coaching.\n\nBut back to your question - what does it mean to live 100% as yourself? I think I am 100% myself. Even when flipping switches. That's part of me. I'm really organized and able to compartmentalize really well, which means that I can go from one thing to another and find joy. Some days I wish my kids and family weren't around so I could work 8 hours uninterrupted for a week! Other days, I feel like I'm itching to get away from my business and spend more time reading or with the kids.\n\nThat's why I built a \"lifestyle\" business though, a business that works around me instead of being controlled by it, but it's still a big part of my life. Without it, I would feel a lot less. And maybe that's something I need to discuss in therapy, but it does drive me every day and helps me feel fulfilled and happy. I have days where I'm more present with kids, less \"on\" for work. Today, Tuesday, I will work about 2-3 hours tops. Tomorrow, about 5, Friday will be about 1 hour. I like that I have this \"organized flexibility\".\n\nI could chat more with you about this, or even link to my site and stories about me that tells you how I got from A to B, but I'm afraid of getting banned for self-promotion (it's happened before even though I've come from a place of service), so happy to chat with you more over messages!"}
{"index":{"_index":"reddit"}}
{"title":"Biz Savings Interest Rates","body":"I’m assuming the answer is obviously that the cost would be too great to a financial institution…. But, why are personal savings interest rates at 4.15% APY (Apple) or 4.00% (AMEX HYS) and business savings interest rates only 1.30% (AMEX Business Checking) at best?\n\nI feel like banks should offer better interest rates for savings/checking business accounts (even with a low ceiling, or “small business restrictions”) to encourage deposits. SMH","url":"https://www.reddit.com/r/business/comments/14e9mwn/biz_savings_interest_rates/","comment":"I think your assumption is correct, businesses tend to have more money so it would be difficult to pay a higher interest but I have 2 more ideas (i am spitballing here): \n1. maybe there are laws that make it so because they want to encourage individuals to save money and discourage businesses from sitting on their cash\n2. Businesses tend to spend their cash more frequently than individuals and banks seem to offer higher interest rates for more “stable” deposits."}
{"index":{"_index":"reddit"}}
{"title":"How much is international ocean freight?","body":"","url":"https://www.reddit.com/r/business/comments/14e9cnq/how_much_is_international_ocean_freight/","comment":"Way too vague to be answered.\nFrom where to where?\nSize of shipment?\nOne time or regular scheduled shipments?\nNow or last year or next year...rates vary based on time of year and business of shipping ports and ships."}
{"index":{"_index":"reddit"}}
{"title":"Hello everyone I want to start a low budget business startup and ideas for me","body":"","url":"https://www.reddit.com/r/business/comments/14e8tm0/hello_everyone_i_want_to_start_a_low_budget/","comment":"Thanks 🙏"}
{"index":{"_index":"reddit"}}
{"title":"Powell Faces Tricky Task of Explaining Rate Pause in Congress","body":"","url":"https://www.bloomberg.com/news/articles/2023-06-20/powell-faces-tricky-task-of-explaining-rate-pause-in-congress?srnd=economics-v2","comment":"For those that encounter a paywall, you can read it here: https://archive.is/20230620092627/https://www.bloomberg.com/news/articles/2023-06-20/powell-faces-tricky-task-of-explaining-rate-pause-in-congress"}
{"index":{"_index":"reddit"}}
{"title":"Bank of England’s conundrum deepens as inflation and labor market stay hot","body":"","url":"https://www.cnbc.com/2023/06/20/bank-of-england-conundrum-deepens-as-inflation-labor-market-stay-hot.html","comment":"\"People are paid too much\" - UK."}
{"index":{"_index":"reddit"}}
{"title":"Macron's Paris summit seeks new life for global finance agenda","body":"","url":"https://www.reuters.com/business/finance/macrons-paris-summit-seeks-new-life-global-finance-agenda-2023-06-20/","comment":"Boo"}
{"index":{"_index":"reddit"}}
{"title":"What is the fastest growing fast food franchise in history or within the last 25 years?","body":"I have been wondering while doing some research of what would be the top fastest growing QSR or fast food brand. Ive seen companies like Shake Shack (early 2000s), Chipotle (early 90s), Raising Canes (mid 90s) and a couple others but many of these brands seemed like they took decades to actually boom. Any ideas of a brand or concept  that boomed or grew a solid foundation within 5-7 years?","url":"https://www.reddit.com/r/business/comments/14e6spz/what_is_the_fastest_growing_fast_food_franchise/","comment":"Maybe, but I was buying Starbucks 20 years ago and globally they are huge now. I live in Australia where there aren't that many as so many other places offer exceptional coffee"}
{"index":{"_index":"reddit"}}
{"title":"Is a directory website a good business to start?","body":"Hi, \n\n\nI’m thinking to start a directory website that will you affiliate marketing on a growing niche that’s projected to be in the trillions by 2030. There’s already a few websites doing the same thing (but competition is a good sign as it means there’s a market) \n\nSo my question is do you think it’s worth starting a directory website and if it is something that is profitable. Ideally I will use SEO/Blogs to get most of my traffic, and possibly test ads.","url":"https://www.reddit.com/r/business/comments/14e5fcy/is_a_directory_website_a_good_business_to_start/","comment":"I have a perfect idea for how to get your idea sold.\n\nI will sell you my idea for selling your idea for only $500."}
{"index":{"_index":"reddit"}}
{"title":"Advice for someone applying for an LLC","body":"Hello, I’m starting a shop and I’m trying to get my EIN because the warehouses I’m ordering the stuff from requires an EIN. The only problem is I don’t have a building for my shop yet because I’m trying to order stuff for my shop. I am aware I can put my address as my home for now but is the process for changing your location to your shop hard ? What would be recommended besides “rent a shop “ because I’m not going to spend 1500+ a month on something I’m not using I want to have my materials before I rent a shop. Any and every advice is appreciated 🤟🏽","url":"https://www.reddit.com/r/business/comments/14dxos7/advice_for_someone_applying_for_an_llc/","comment":"There’s a couple of different questions here. But the long a short is - it depends on your state. Usually it’s easy to change address. File the paperwork with your state, once they approve go online to the IRS and get an EIN."}
{"index":{"_index":"reddit"}}
{"title":"The Telegraph: European Investment Bank hit by cyber attack after Russian hackers vow to bring down financial system","body":"","url":"https://www.telegraph.co.uk/business/2023/06/19/european-investment-bank-cyber-attack-russian-hackers/","comment":"All they have to do is blast the illegal shit that finance people do daily and itll have to be dealt with."}
{"index":{"_index":"reddit"}}
{"title":"Intel confirms deal for $33 billion German factories","body":"","url":"https://www.oregonlive.com/silicon-forest/2023/06/intel-confirms-deal-for-33-billion-german-factories.html?outputType=amp","comment":"$110 billion in stock buy backs. Get $11 billion in tax payer subsidies. Genius!"}
{"index":{"_index":"reddit"}}
{"title":"Insurance companies buckling under climate risks","body":"","url":"https://www.bangordailynews.com/2023/06/19/opinion/editorials/insurance-climate-risks/","comment":"That's contrary to this article as well as to statements from insurers citing climate change when abandoning certain states."}
{"index":{"_index":"reddit"}}
{"title":"How to respond to: \"Why wouldn't I hire a freelancer instead?\"","body":"I am going to do sales for a creative agency over summer break for some cash and after looking at Freelancer.com and other websites I was left wondering how we could compete with those prices.\n\nI was wondering how to respond if a prospect asks: \"Why you over [cheaper service provider]?\"","url":"https://www.reddit.com/r/business/comments/14dkspq/how_to_respond_to_why_wouldnt_i_hire_a_freelancer/","comment":"Quality of work. You do more research, you spend more time honing the message, you spend the time to get it right."}
{"index":{"_index":"reddit"}}
{"title":"Hackers threaten to leak stolen Reddit data if company doesn't pay $4.5 million and change controversial pricing policy | CNN Business","body":"","url":"https://www.cnn.com/2023/06/19/tech/reddit-hackers-demands-api/index.html","comment":"According to the report, hackers from the BlackCat ransomware gang, also known as ALPHV, are threatening to leak 80 gigabytes of confidential data from Reddit that they allegedly stole during a breach in February 2023. They are demanding a $4.5 million payout and are asking Reddit to withdraw a controversial new pricing policy​1​.\r  \n\r  \nReddit's CTO, Chris Slowe, had previously posted about a security incident in February, stating that the company’s systems were hacked through a sophisticated and targeted phishing attack. The hackers reportedly accessed some internal documents, code, and some internal business systems. \r  \n\r  \nThe controversy with Reddit's new pricing policy has led to more than 6,000 Reddit forums going dark in protest. The protest was intended to last for two days, but a week later, more than 3,500 Reddit forums remain dark.  \n\r  \nWhile the hackers' ransom note appears to support the protestors' cause, experts are skeptical of BlackCat's actual motives. Brett Callow, a threat analyst at cybersecurity firm Emsisoft, suspects that the ransomware gang's true intent is to demonstrate the extent of harm they can inflict, in order to increase the likelihood of future victims deciding to pay the ransom​.\r  \n\r  \nThe BlackCat group, however, stated that they do not expect Reddit to meet their demands and are confident that the data will be leaked​​."}
{"index":{"_index":"reddit"}}
{"title":"Airbus Wins Record 500 Jet Order From India’s Biggest Airline","body":"","url":"https://www.bloomberg.com/news/articles/2023-06-19/airbus-wins-record-500-jet-order-from-india-s-biggest-airline?srnd=premium","comment":"***Thank you for sharing our reporting.*** [***Read it for free here with your email.***](https://www.bloomberg.com/news/articles/2023-06-19/airbus-wins-record-500-jet-order-from-india-s-biggest-airline?srnd=premium\u0026sref=PFCuwcPr)  \n*From Bloomberg News reporters Ragini Saxena and Siddharth Vikram Philip:*  \nIndiGo placed a record-breaking order with Airbus SE for 500 narrowbody aircraft, making a bold bet well into the next decade on an undiminished travel boom in the world’s most populous country.   \nIndia’s dominant carrier announced the deal at the Paris Air Show, giving Airbus an early win on the first day of the event while rival Boeing stood on the sidelines. [Read more](https://www.bloomberg.com/news/articles/2023-06-19/airbus-wins-record-500-jet-order-from-india-s-biggest-airline?srnd=premium\u0026sref=PFCuwcPr) on the biggest aircraft order in aviation history."}
{"index":{"_index":"reddit"}}
{"title":"Business term for a \"possibilities\" meeting?","body":"New to management and still adjusting to lingo. We're essentially getting with tech to describe to them what we need, and we need them to tell us if it's possible using our current systems/current setup. What term would I use for a meeting like that?\n\nEdit: I know people are saying the \"lingo\" isn't needed, but I want to know a word or two that would capture the meeting purpose, for simplicity's sake, and to save others time when sifting through emails/meeting invites.","url":"https://www.reddit.com/r/business/comments/14dd9cy/business_term_for_a_possibilities_meeting/","comment":"Workshopping"}
{"index":{"_index":"reddit"}}
{"title":"Pirelli: Italy blocks Chinese control of tyre giant","body":"","url":"https://www.bbc.com/news/business-65947050","comment":"Thank god. Fuck PRC"}
{"index":{"_index":"reddit"}}
{"title":"Reddit CEO Triples Down, Insults Protesters, Whines About Not Milking Enough Money From Reddit Users","body":"","url":"https://www.techdirt.com/2023/06/16/reddit-ceo-triples-down-insults-protesters-whines-about-not-making-enough-money-from-reddit-users/","comment":"The boycott may not have succeeded, but my adblocker will."}
{"index":{"_index":"reddit"}}
{"title":"Japan regulator sounded out top domestic banks about China risks, sources say","body":"","url":"https://www.reuters.com/business/finance/japan-regulator-sounded-out-top-domestic-banks-about-china-risks-sources-say-2023-06-19/","comment":"\u003e As of end-March, the three banks had total credit exposure of about $64 billion to China, or roughly 1% of their total assets, according to their financial statements. The number does not include all business unit of the banks.\n\nAt worst they need to write off that 1%."}
{"index":{"_index":"reddit"}}
{"title":"Amazon, Marriott and other companies vow to hire thousands of refugees in Europe","body":"","url":"https://apnews.com/article/russia-ukraine-war-refugees-hiring-b788fcf75597e8a5f1f0a846e0b58c37","comment":"And fire thousands of Europeans? 😶"}
{"index":{"_index":"reddit"}}
{"title":"How does one start a business?","body":"","url":"https://www.reddit.com/r/business/comments/14d5c19/how_does_one_start_a_business/","comment":"You visit the business building in your city, enter your name and press the start button. Voila!"}
{"index":{"_index":"reddit"}}
{"title":"The Profit and Shark Tank Offer construction?","body":"I am going to school for business (although only beginning classes currently) and I am interested in M\u0026A and investing. I enjoy watching The Profit with Marcus Lemonis and Shark Tank. The only question I had is in both of these shows the sharks and Marcus seem to have very specific offers when trying to buy a portion of the business. My question is, is there like a specific equation they follow? Or is the offer made up by what feels right? How is their offer constructed to minimize risk and maximize the potential for profit?","url":"https://www.reddit.com/r/business/comments/14d52q5/the_profit_and_shark_tank_offer_construction/","comment":"They are judging the idea and its potential for success and just how big the company could get versus how much money the owners need and how much of the company they are willing to sell.\n\nThink about it this way: When Amazon raised money before anyone outside Bezos knew what it was, they had to sell a large % of the company for a few hundred thousand dollars (I suspect, I don't know specifics about Amazon. It's just an example.)\n\nLater, when it went public, they sold a small percentage of equity (maybe 20%) in the IPO for several million dollars.\n\nNow, if they wanted to raise several billion in equity, they would only have to sell a small fraction of shares (maybe less than 1%).\n\nThe sharks are looking at companies that no one (barely) has heard of because they are new and small, so they are making a judgment on how much they want versus how much they want to pay. They have done it a lot, so there is no specific equation, but they know the businesses and how to eyeball a valuation on them."}
{"index":{"_index":"reddit"}}
{"title":"Is this a good offer?","body":"Hey Reddit,\n\nI recently received an offer from a serial entrepreneur who has had a successful exit of over $10 million. They are planning to launch a new venture in the digital fitness/app space and have approached me, emphasizing my high talent and skills, as a crucial member of their desired team.   \nThey also plan to fund %100 of the initial stage of the company. They will hire additional people with salary-only no equity for them. \n\nI would greatly appreciate your unbiased opinions on the offer. Here are the details:\n\n* Start part-time without leaving my current full-time job. No salary, but receive an unconditional 1% equity.\n* Upon securing the first external investor, an additional unconditional 0.5% equity is granted. Part-time work continues with no salary.\n* I can then join full-time, with a full salary and an extra 3% equity over three years (1% per year).\n* An extra 2.5% equity is possible based linked to achievements and performance to be decided later.\n\n\u0026#x200B;","url":"https://www.reddit.com/r/business/comments/14d43u8/is_this_a_good_offer/","comment":"\u003e No salary, but receive an unconditional 1% equity.\n\nThis is a shit deal. Work for free, for a miniscule bit of equity.\n\nIdeas are cheap and easy, execution is difficult."}
{"index":{"_index":"reddit"}}
{"title":"One of my employees ex gf’s is threatening to craft tons of negative fake google reviews for my business if I don’t fire the employee.","body":"I really have no idea how I have found myself in this situation. I own a small restaurant, we depend heavily on google and Facebook reviews to drive new customers to our location. \n\nMy restaurants manager is being harassed by an ex and the ex is threatening to destroy my google and fb reviews if I don’t fire her. I don’t have cause and I really don’t want to fire her. She’s a good employee. I have done nothing to this person and am just caught in the cross fire and it’s really upsetting me. \n\nDoes anyone have any good suggestions? Has anyone dealt with anything like this before?","url":"https://www.reddit.com/r/business/comments/14d2631/one_of_my_employees_ex_gfs_is_threatening_to/","comment":"Blackmail is illegal most places, and I have a feeling this fits. I’d see if you can file a police report and check with your attorney about sending a letter regarding civil action for defamation, blackmail and loss of business if this person does anything. Rather than running scared, take the offense."}
{"index":{"_index":"reddit"}}
{"title":"Ford chairman says US can't yet compete with China on EVs - CNN interview","body":"","url":"https://www.reuters.com/business/autos-transportation/ford-chairman-says-us-cant-yet-compete-with-china-evs-cnn-interview-2023-06-18/","comment":"“They developed very quickly, and they developed them in large scale. And now they’re exporting them,” Ford told CNN’s ‘Fareed Zakaria GPS’ Sunday program. “They’re not here but they’ll come here we think, at some point, we need to be ready, and we’re getting ready,” Ford said.\n\nIn February, the automaker announced plans to invest $3.5 billion to build an electric vehicle battery plant in Michigan in a deal which involved using technology from Chinese battery company CATL, attracting attention from U.S. Senator Marco Rubio who asked the Biden administration to review the deal.\n\nBill Ford, who is the great-grandson of company founder Henry Ford, said in the program that the Michigan battery plant is a chance for Ford engineers to learn the technology and then use it themselves.\n\n        “It (Michigan) is a wholly owned Ford facility. They’ll be our employees, and all we’re doing is licensing the technology. That’s it.” he said.\n\nFord CEO Jim Farley said in May that Chinese electric vehicle makers are its main rivals in the sector, and that Ford needs distinctive branding or lower costs to beat Chinese automakers.\n\n“I think we see the Chinese as the main competitor, not GM or Toyota. The Chinese are going to be the powerhouse,” he said.”"}
{"index":{"_index":"reddit"}}
{"title":"How Should I Hire an Employee with a Stock Option Agreement for a Digital Marketing Agency?","body":"Hi All,\r  \n\r  \nI am starting a digital marketing agency and I would like to hire a past colleague of mine to be my main content creator/strategist. The problem is because this is a small business, we don't have a lot of cash flow to pay his salary. We agreed on lower pay with a stock option. Basically, I would like to draft a contract stating he gets the option to buy X% of the company for every 12 months he works with us with a cap of Y%. What is the best way to go about doing this?","url":"https://www.reddit.com/r/business/comments/14cyfpe/how_should_i_hire_an_employee_with_a_stock_option/","comment":"If he gits gud for one year, he controls 100% of the shares."}
{"index":{"_index":"reddit"}}
{"title":"Help: I promoted some employees and now I'm having a mutiny!","body":"Hi All, dramatic title for attention, but I promoted some employees and there has been some serious pushback to this. I, as the business owner, was functioning as store manager, so I promoted two employees (been with me since the beginning) to serve different managerial positions because the business is growing and I can't handle it all anymore. Three other employees have pushed back against this hard (they've been employees \u003c1yr). How do I help my employees see the two new managers as an extension of me rather than a new person telling them what to do?","url":"https://www.reddit.com/r/business/comments/14cxdwu/help_i_promoted_some_employees_and_now_im_having/","comment":"Just fire the complainers... they will never be happy.   New hires will see the newly promoted employees as  management when they start."}
{"index":{"_index":"reddit"}}
{"title":"I'm thinking of selling my online business but I have no idea how to figure out what it's worth!","body":"So I run a dog treat business online and I also take my business to markets and events where I'll have a stall, some small scale events and some huge events. \n\nUnfortunately I've just not got the time or energy to keep this going so I thought about selling the business but I've no idea how to figure out what the sale price should be, bear in mind that this is a \"small\" business and would be suitable for someone just starting out or wanting to grow an existing business. Here's a breakdown of what the buyer would get: \n\n- Instagram account with 8.5k followers with fairly okay engagement and relationships with a number of pet influencers \n- a pre-made ready to go website (but they will have to renew the yearly subscription cost of this themselves but it's not much) \n- a list of key suppliers \n- my dog treat recipe and how to guide (I'd even be happy to meet the buyer in person to teach them how to bake and ice the treats)\n- my dehydrating equipment (this drys the icing on the treats and extends their shelf life)\n- baking equipment and accessories (won't include ovens as this was all done at my home) \n- list of valuable contacts/clients \n- separate wholesale website for business orders (comes with many clients) \n- any existing packaging/labelling/branding I still have \n- any existing stock I have (I also sell dog toys and accessories alongside handmade treats) \n\nThat's all I can think of at the moment. In terms of finances, the business made about £15k profit in its first year, about £10k in its second year and this year is on track to be about the same but this is bearing in mind that I've been very lax with this business and not put much effort into it lately. If I did I could probably have made a lot more. \n\nBased on that, what would this business be worth or what would you consider buying it for? UK based by the way!","url":"https://www.reddit.com/r/business/comments/14cwkla/im_thinking_of_selling_my_online_business_but_i/","comment":"Business broker here in the US. \n\n10k GBP would be around 13k USD. A business in the US cash flowing on this level would go for between 1X and 3X. The low side would mean it takes the owner’s part-time effort, less predictable income, and trickier to scale. The higher multiple would be a business operating basically on its own, in a predictable way, with upside room to scale."}
{"index":{"_index":"reddit"}}
{"title":"Reddit in crisis as prominent subreddits protest","body":"","url":"https://www.cnbc.com/2023/06/16/reddit-in-crisis-as-prominent-moderators-protest-api-price-increase.html","comment":"And reddit responds by threatening to remove the protesting mods."}
{"index":{"_index":"reddit"}}
{"title":"The New York Times: U.S. National Debt Tops $32 Trillion for First Time","body":"","url":"https://www.nytimes.com/2023/06/16/business/economy/federal-debt-32-trillion.html","comment":"31 was fun"}
{"index":{"_index":"reddit"}}
{"title":"Wife and I are thinking about opening up a small, independent bookstore in a nearby city—where do we find investors?","body":"","url":"https://www.reddit.com/r/business/comments/14csmpn/wife_and_i_are_thinking_about_opening_up_a_small/","comment":"In the mirror - those are the best investors."}
{"index":{"_index":"reddit"}}
{"title":"Young entrepreneur with a quick Q.","body":"I’ve researched basic business formulas and such. How can I apply this knowledge to actually choosing a business. I’m having a hard time choosing between what Im interested even though it’s a physical product and could be very taxing vs what I believe could make me profitable which is more internet/ social media advertising based. Should I do what’s easier and less risky or?","url":"https://www.reddit.com/r/business/comments/14crv51/young_entrepreneur_with_a_quick_q/","comment":"Profit First.  Then when ready incorporate the other endeavors. I believe it’s called a business segment.  Good luck"}
{"index":{"_index":"reddit"}}
{"title":"I dropped out of high school and skipped 10th-12th grade with a GED. Now I’m 17 and I do pressure washing and Amazon FBA. But I have a major problem.","body":"My motivation has been dwindling since leaving school because of social isolation - I have no friends that share my interest in entrepreneurship.   \nCan you imagine trying to learn any other skill without a community? We have classrooms in school, we have teams in sports, but in business... you’re on your own. Why?  \nIf you are interested in E-commerce, or know someone who is (kids, cousins, friends etc), PLEASE send me a personal message.   \nI know you guys are very rare. But I know you’re out there somewhere.","url":"https://www.reddit.com/r/business/comments/14cr304/i_dropped_out_of_high_school_and_skipped_10th12th/","comment":"go learn some skills first, skills and work will give you insights"}
{"index":{"_index":"reddit"}}
{"title":"Reddit CEO defiant goes full dictator as moderator strike shutters thousands of forums","body":"","url":"https://fortune.com/2023/06/17/why-is-reddit-dark-subreddit-moderators-ceo-huffman-not-negotiating","comment":"I care because I am grateful for the volunteers who make reddit worthwhile and I believe them when they say that the in-house support infrastructure available to them is inadequate.\n\nEdit P.S:  the childish and at times dishonest way the CEO has handled this hasn’t helped his cause."}
{"index":{"_index":"reddit"}}
{"title":"Entrepreneur","body":"Whats are things people dont want to that are profitable at the end??","url":"https://www.reddit.com/r/business/comments/14cofsq/entrepreneur/","comment":"[removed]"}
{"index":{"_index":"reddit"}}
{"title":"Why Insurance Companies Are Pulling Out Of Fire-Prone Areas in California","body":"","url":"https://mountainjournal.org/why-insurance-companies-are-pulling-out-of-fire-prone-areas","comment":"when a wildfire goes through an area, does that make it less prone to future wildfires (because the fuel is gone), whether short or long term?  compared to continually rebuilding in flood prone areas"}
{"index":{"_index":"reddit"}}
{"title":"Help improving 12 year old roofong business","body":"Ive owned and operated a residential shingle company for over 12 years. We had 2 x 5 guys crews running last year. \nThis year ive had to lay of 1 whole crew. Not enough jobs. Lately ive been concentrating on trying to close deals and find leads.\n\nI was looking at other companies work crews and how they run and operate on site.\nI was wondering if theres any musts or processes i should be following to make the crew and job site run more efficiently\n. \nLooking for any advice on how to improve my crew and process of doing roofs.\n\nJust anything to will help my business from failing and doing better than competitors. Advancing our service and trying to be a leader in the industry,\n\nI could use some help/ guidance/ advice, as i refuse to quit on this business.","url":"https://www.reddit.com/r/business/comments/14codi7/help_improving_12_year_old_roofong_business/","comment":"This is way to vague, and how could we tell without seeing? Look for a retired, successful roofer to hire as a consultant. \n\nMy guess is you're charging too much or doing poor quality work. Or you're in a depressed area and there just isn't enough demand. \n\nIn much of the US there is a shortage of good contractors so if you do decent work at competitive rates you'll have all the work you can handle."}
{"index":{"_index":"reddit"}}
{"title":"What is a rich-people problem that could be solved?","body":"I read a good thought that if you solve rich people's problem, you get to charge rich people prices. And I want to do it. What is something to get paid for a lot, if I am willing to put in the work and discipline, and educate myself?\n\nEspecially a project-like thing, or a partnership with someone.\n\nLike what does have a good premium demand but not enough people to solve it. Globally, but especially EU and USA.","url":"https://www.reddit.com/r/business/comments/14cl1wl/what_is_a_richpeople_problem_that_could_be_solved/","comment":"Not an expert, but private accounting, financial planning, and wealth management would likely all be interesting. There is already a lot of this in the EU and USA tbf, but as more developing countries like the BRICS (a lot going on rn) develop I’m sure there’ll be a growth in people who need such financial services. E.g. starting an Indian financial planning/advisory business and connecting them with opportunities in foreign markets to allocate their recent wealth could be lucrative. Is a good question though, keen to hear other ideas."}
{"index":{"_index":"reddit"}}
{"title":"Bloomberg: Geneva Voters Turn Down Wealth Tax Increase for Richest 1%","body":"","url":"https://www.bloomberg.com/news/articles/2023-06-18/geneva-voters-turn-down-wealth-tax-increase-for-richest-1?srnd=premium","comment":"Rich folks vote down to increase tax on rich folks by 1 %"}
{"index":{"_index":"reddit"}}
{"title":"Early Stages: Website or App?","body":"Low-code/No-code tools have made it easier than ever to deploy websites and mobile apps.\n\nDoes this mean that companies should be on web and mobile now? Is that expected from users? \n\nOr is is fine to just have a website or an app and drive all your traffic to the one you have?\n\nInterested to see what r/business thinks is more essential between the two platforms.","url":"https://www.reddit.com/r/business/comments/14chb12/early_stages_website_or_app/","comment":"Note: ran two startups; in the tech field at a leadership level\n\nIt really depends on what you’re trying to accomplish. Are you selling a tangible product? Shopify, et al. are more than likely the tools youre looking for. Are you trying to build a communication tool? What kind??? Do you want people to talk on the go? Do you want them stationary at a desk?\n\nThe early stages are much more flexible, and it really depends on a business’s needs and goals. At a certain point, those needs and goals change so the need can become different. Let’s say you’re selling sweatshirts but you blow up and Shopify is just too expensive. It might be worthwhile to invest in a custom system that allows you to manage inventory, sales, and order processing (think Target).\n\nOn the other hand hand let’s say you have some comms tool. Your little app was doing wonders, as it was a quickly written react native app. Well, you might need to scale that, growing a team of security experts, system admins, and coders to maintain and expand the product. \n\nOut the gate, unless your focus is mobile focused, a general website is fine. Really just depends."}
{"index":{"_index":"reddit"}}
{"title":"taxes?","body":"Long ago in 2021 , i went to tax business Jackson whatever.  At that time i probably made about $3,000 maybe a little less on Onlyfans that year. Anyways , i owed back taxes on something different so i thought it would be wise to ask for advice other then doing my taxes all by myself that year. I brought up Onlyfans as this individual saw my 10-99 form on the side. after looking at them he said not to bother claiming taxes since i havent made 10,000 or more with Onlyfans and that id be spending hundreds on something that they dont report since i havent made a curtain amount. He did mention to get another credit card and pay for curtain things for tax write offs in the future if i want to make alot more money off Onlyfans. So fast forward to 2023, ive made $8,233 off onlyfans as of right now. When should i pay taxes?  Onlyfans says i dont have to claim anything below $600 yearly if that's all i made.. So im wondering if i have to get $10,000 yearly for a flag to pop up to the irs or if i make $10,000 with them in general for a flag to pop up..\nFugggeee i never did that credit card 🤦‍♀️🤦‍♀️\nWhat are your experience with this?\nHave any stories? If so please do share.","url":"https://www.reddit.com/r/business/comments/14cc3l7/taxes/","comment":"You were given bad advice. If you have self employment income over 400.00 you are required to file a tax return and pay taxes.\n\nIf you file a tax return for other income, you have to report any and all income. You can't legally leave off any income.\n\nThe IRS gets a copy of that 1099, so they expect to see that income addressed on your tax return.\n\nYou can deduct your business expenses. You don't need a separate business card."}
{"index":{"_index":"reddit"}}
{"title":"How does a restaurant avoid taxes in the UK by only accepting cash?","body":"Hello r/business,\n\nI recently bought from a Chinese takeaway that only accepted cash. I was wondering why they do this, I am speculating it is because they don't pay as much tax. Do they do this by not recording every 3rd sale, can someone assist me in the reasons why they do this and how? And if there is any better sources to read up on this. The question is directly aimed at the Food \u0026 Catering business sector in the UK.  \n\n\nThanks.","url":"https://www.reddit.com/r/business/comments/14c83ju/how_does_a_restaurant_avoid_taxes_in_the_uk_by/","comment":"Also at a more basic, legal level, they don’t pay credit card transaction fees if it’s cash only, saving them a few percent per customer.  And a lot of those places have an ATM on site that they make money from too."}
{"index":{"_index":"reddit"}}
{"title":"Need guidance","body":"I was hoping I’d get some advice from everyone about this scenario.\n\nAn old co-worker contacted me about going into business together.  He will be fronting all the cash for it (about $300k).  He wants me to be run the business and insists that we are partners in it.  He doesn’t want me to just manage it.  As he puts it “so I’d have some skin in the game.”\n\nI’m all for it.  We both worked really well together in the past.\n\nMy question is, how would this work?  Has anyone else ever done something like this?  We are wondering how pay would work (with me) while the build out and training is taking place, As well as going forward.  The plan is to open several of these in the future.\n\nHopefully that makes sense?  I’ve always been an “employee,” so not sure how this end of it would work?\n\nThanks!","url":"https://www.reddit.com/r/business/comments/14c6wvz/need_guidance/","comment":"1) Make sure you spell out the ownership percentages. If he is financing and making all the decisions, your share means you work for free until the business is profitable.\n\n2) If you are running the business you are an employee and are entitled to a salary regardless oif your ownership percentage. After all, if he was 100% owner he waould have to hire a manager. \n\n3) Make sure you have access to the books. As an owner you should be able to see the inflow and outflow and profitability."}
{"index":{"_index":"reddit"}}
{"title":"What jobs do business majors from a lower-ranked state school get?","body":"Hello, I'm thinking about majoring in business at my state school this fall. I'm just not sure what kind of jobs people get after graduation.\n\nLike I know ppl who go to prestigous business schools like stern or wharton get jobs in IB or big management positions but what do the people at the lower-ranked state schools usually get into right after graduation?\n\nAny help is appreciated!","url":"https://www.reddit.com/r/business/comments/14c6riw/what_jobs_do_business_majors_from_a_lowerranked/","comment":"I sell insurance"}
{"index":{"_index":"reddit"}}
{"title":"Help Dealing with an Unstable Client","body":"This is a combination of psychological/ business advice. I am a lawyer and have a client who is unstable. I was able to collect 100% of a judgment that she got against her ex-husband through various court procedures. In sum, I got a good result for her. About 20% of what I collected was for my legal fees. The fees were very reasonable for the work put in. She demanded that I also get an order that her ex-husband pay my legal fees. I told her we do not have a high chance of success in this since the general rule is, unless there is a contract to the contrary, that each side pays there own legal fees. I ended up, partly because of her pressure, fighting to get her her legal fees and we lost. Now she is angry and wants me to make what I believe is a frivolous appeal. She is highly unstable due to medical issues. She is a lawyer herself, but due to these issues she has not practiced law much.   \n\n\nBasically she is implicityly threatening to sue me if I don't do what she wants. How to avoid a long battle with her. I want to withdraw from the case. The question is, what do I tell her. My thought is just make her know that I am still there to help her brain storm about the case, although I wont be filing anything, and that if she has other issues in the future I am there to help. If she sues me, although it will be frivolous, it will start taking up a lot of my energy over what could be years. She is highly vindictive and irrational. \n\nThanks!","url":"https://www.reddit.com/r/business/comments/14c4tr5/help_dealing_with_an_unstable_client/","comment":"Gee, talk with a lawyer!"}
{"index":{"_index":"reddit"}}
{"title":"Want to know if this is legal","body":"I have an idea of “hiring” some people to help me expand my business (jewelry).\nThe idea is to train a few folks to make some of my products so they can help me in the process of making them. I would then pay them a commission rate instead of an hourly rate.\n\n(Based on how fast they make each product, the amount they would make per hour would highly exceed minimum wage) \n\nI would then regularly hire them as contractors who can pick up work anytime they’d like. \nThis means I can avoid all the paperwork that comes with having employees and these people would get paid well above minimum wage.\n\nDoes this sound fair and does it bend or break any rules.\nThis might sound like a dumb question but I just wanted to make sure as it’s better to be safe than sorry.","url":"https://www.reddit.com/r/business/comments/14c3hba/want_to_know_if_this_is_legal/","comment":"You theoretically can do this if you’re very careful about it. Research the difference between employees and contractors. Essentially you can show them how to make your product, and then pay them based on their production - hourly “wage” gets to be very close to being an employee and it’s probably not a good idea. \n\nEssentially: “this is how to make my bracelets. I will pay you $1000 for 1000 bracelets by Thursday, per this contract. Here is where to purchase supplies” is the simplest way to ensure they’re contractors.\n\nYou cannot dictate work hours, how they do the job, provide them tools to do the job, or otherwise control them other than quality control for the finished product. There’s a million little nuances in there, so you really should talk to an accountant or attorney before you do anything. \n\nOr just do what you want, the chances of you getting in trouble are slim. But you didn’t hear that from me."}
{"index":{"_index":"reddit"}}
{"title":"Getting comfortable accepting money.","body":"For those who had any anxiety with regards to accepting money for services, how did you get over it?\n\nIf I'm accepting money in behalf of a job, I can do it no problem. But if I'm doing a side hustle I just feel weird accepting money. I'm not sure if it's a form of imposter syndrome, overthinking, or lack of trust in online payment methods or all three, but I haven't made progress. \n\nMy best idea at getting over it is to try selling low value things on Facebook or craigslist to get over both the idea of accepting money and the fear of getting robbed by them no actually fulfilling payment or reversing payment after taking the item, or leaving money on the table somehow. I'm almost certainly overthinking this whole thing, but making progress on my own hasn't been working.","url":"https://www.reddit.com/r/business/comments/14c2dc5/getting_comfortable_accepting_money/","comment":"You should listen to Sue Bryce's TEDx talk on YouTube named: Changing Perspective from Shame to Self Worth \n\nShe discusses this phenomenon and how to fix it."}
{"index":{"_index":"reddit"}}
{"title":"Phone reselling idea from different states","body":"\nI live in Darwin at Australia\n\nI buy phones for cheap on marketplace and resell them\n\nThere’s good bargains in other states (Melbourne, Sydney etc)\n\nMy idea is to hire someone from the other states to go collect them, FaceTime me to inspect them because I know how to identify faults well, then ship them to me, all of which would generally take an hour\n\nThe problems is it’s risky for me\n-what if my employee runs off with the phone when I payId the seller\n-what if my employee runs off with the money when I transfer it to him to purchase it from the seller\n\nIs there a way to mitigate this security risk? Should I get legal somehow and make them sign some sort of contract? What would you suggest?\n\nAlso having the seller ship it themselves is not an option, 90% of the time they want to make the deal in person hence why I’d need to hire someone","url":"https://www.reddit.com/r/business/comments/14bzzk6/phone_reselling_idea_from_different_states/","comment":"Things to consider. Profit margins, how many can you pay the person on the other end. Figure out weekly. Would you do the job and inconvenience your day for that amount?\n\nLiability, even properly inspected you can run into issues. Bluetooth, network cards, aftermarket glass, etc. \n\nIf you think it's possible. It's easier to do your search by region you have someone. Not finding someone for a region. So try to find people and then target those areas."}
{"index":{"_index":"reddit"}}
{"title":"Major in management or minor in finance","body":"So I’ve finished 2 years of my business degree where my main major is business analytics and for my second major, at the moment it is management and I just have 3 more units left. I’m thinking of swapping it out for a finance minor. Is it worth it or do I just continue my management major.","url":"https://www.reddit.com/r/business/comments/14bynbt/major_in_management_or_minor_in_finance/","comment":"Finance. No doubt. Finance is something you can learn in school. Management isn’t."}
{"index":{"_index":"reddit"}}
{"title":"PCMag: Toyota Touts Solid State EVs With 932-Mile Range, 10-Minute Charging by 2027","body":"","url":"https://www.pcmag.com/news/toyota-touts-solid-state-evs-with-932-mile-range-10-minute-charging-by","comment":"Toyota announced a major battery breakthrough in 5 years, back in 2017.  Now they announce a solidstate battery break through in 5 years…..ok"}
{"index":{"_index":"reddit"}}
{"title":"HTS code for imported goods from China","body":"If you are importing wet wipes made entirely of water and 100% cotton, what would be the HTS code for this? Does anyone know?","url":"https://www.reddit.com/r/business/comments/14brwtp/hts_code_for_imported_goods_from_china/","comment":"It’s subject to change \nWhy not ask the custom agency?"}
{"index":{"_index":"reddit"}}
{"title":"I work at Olive Garden which is owned by CMR, is Olive garden doing business as CMR or is CMR doing business as Olive Garden","body":"","url":"https://www.reddit.com/r/business/comments/14br33x/i_work_at_olive_garden_which_is_owned_by_cmr_is/","comment":"CMR is probably a franchisee. The Olive Garden brand is owned by Darden Restaurants. You can open a restaurant and pay Darden a franchise fee to use the Olive Garden name and menu and you have to uphold certain standards to keep the name. \n\nFranchising is a common ownership structure for hotels and restaurants."}
{"index":{"_index":"reddit"}}
{"title":"How can I come up with website ideas for a business?","body":"I'm a 17 year old who has been into web developement for some time new (still a newbie though). 1 year ago I was brainstorming for ideas and I had the idea where people can upload their mangas or comics on my website and I spent about a year developing the site (more like 5 months but the hosting process was tough for me cuz I didn't want to use any money so I had to look for free alternatives). A month or two ago I found out about webtoon which is the exact same thing as my idea but was mainly for webtoons. I was a few years late when it came to this idea. I have attempted a few brainstorming sessions for some website ideas but to no avail, I also came up with that idea due to me being a huge anime fan (and sheer luck). I always go about thinking of problems that I can solve through my website but I always come up with weird ideas like \"an exclusive website for cat videos\". I haven't been able to come up with a decent idea for a website for a while now and that's hindering my process and growth as a web developer and more so as an entrepreneur. Web development is one of the only few things I can do as I have a potato laptop that can barely handle web development too.\n\nPlease help me out with this situation.","url":"https://www.reddit.com/r/business/comments/14bq37v/how_can_i_come_up_with_website_ideas_for_a/","comment":"I want to sell my idea for $5000. Fully scalable website that \"should\" also be an app. There will be some redtape to establish this site and idea, but if it works you will probably become a millionaire. Let me know. I'm just too stupid to do the development, but no hard coding will be needed."}
{"index":{"_index":"reddit"}}
{"title":"Reddit's fight with its most powerful users enters new phase as blackout continues | CNN Business","body":"","url":"https://edition.cnn.com/2023/06/16/tech/reddit-blackout-fight/index.html","comment":"**key points of the article : **\n\n- Reddit CEO Steve Huffman defends the initial decision to charge third parties for data access, leading to ongoing protests involving thousands of forums on the site.\n- Reddit is laying the groundwork for ejecting forum moderators committed to continuing the protests, which could force open some communities that remain closed to the public.\n- The protests highlight the rift between Reddit's corporate managers and its unpaid volunteer moderators who manage conversations in individual subreddits, pitting Reddit's corporate interests against users and outside developers who have long argued they create value for the platform's owners.\n- Huffman believes the blackouts are not representative of the greater Reddit community, with many users now wanting their favorite communities to open back up. Huffman has also accused some of its most vocal third-party developers of being freeloaders.\n- Reddit appears to be maneuvering for a crackdown by allowing forum users to overrule moderators by voting them out of their positions, and viewing communities that remain private as an indicator that the moderators of those communities no longer wish to moderate.\n- Some moderators have interpreted the company's message as a threat and a twisting of Reddit's terms.\n- Content moderation on Reddit stands to worsen if the company continues with its plan, according to some moderators.\n- Reddit has promised to update its proprietary tools for moderators and argued that the protests have had little impact on the company financially."}
{"index":{"_index":"reddit"}}
{"title":"The Dutch solution to busyness that captivated the world: « Niksen – a Dutch wellness trend that means \"doing nothing\" – has caught the attention of the world as a way to manage stress or recover from burnout. »","body":"","url":"https://www.bbc.com/travel/article/20230522-the-dutch-solution-to-busyness-that-captivated-the-world","comment":"Reference: Olga Mecking, Niksen: Embracing the Dutch Art of Doing Nothing. Harvest Publications (2021), ISBN: 9780358395317. https://www.harpercollins.com/products/niksen-olga-mecking?variant=39935634669602"}
{"index":{"_index":"reddit"}}
{"title":"Why Spotify's big bet on Meghan fell flat","body":"","url":"https://www.bbc.com/news/business-65936228","comment":"You just described paying for the service almost solely for one content creator. You cannot possibly fathom a world where one other person does the same for someone you would deem the meaningless word woke? You almost entirely pay for the service based on YOUR “identity politics.”"}
{"index":{"_index":"reddit"}}
{"title":"Nearly all Americans cut spending amid inflation","body":"","url":"https://www.cnbc.com/2023/06/14/nearly-all-americans-cut-back-on-spending-amid-inflation-cnbc-survey-says.html","comment":"No shit. Let me guess water is wet...\n\nWhen you take home $100 from work and things cost $50 you spend $50.\nWhen you take home $100 from work and things cost $75, you spend $25. Spending has to go down since no one's getting a fucking 10% annual raise."}
{"index":{"_index":"reddit"}}
{"title":"Financial Times: Russia moves to seize ‘naughty’ western companies","body":"","url":"https://www.ft.com/content/cd627211-68f6-4dfa-8a04-3344deee2e85","comment":"I'm going to assume that's just poorly translated Russian."}
{"index":{"_index":"reddit"}}
{"title":"Anyone have experience dealing with BHG Financial?","body":"Hey all. I'm in the process of opening a new business and was approved for a loan from a company named BHG Financial. Is anyone familiar with them, have first hand experience with them and provide some info?\nThe following are the listed benefits of their loan. \n* Term is 84 months\n* I'm the guarantor but the loan is in the new business name\n* The loan will not report to my credit or show as a tradeline on my report\n* Based off a fixed interest rate (14.99%) so I'll only paying interest on the remaining principal balance\n* Not collateralized against personal property or assets\n* Fees and interest could be tax deductible (they advise to consult with a CPA for full details on this)\n* 12 Month Commitment Period (i.e. I'll have the option to pay off the loan in full without any penalties after 12 months)\n* No out of pocket expenses\nAny info will be appreciated. Thanks.","url":"https://www.reddit.com/r/business/comments/14bfesk/anyone_have_experience_dealing_with_bhg_financial/","comment":"Only 12 months? What is the loan for? If for inventory or short term purposes that is fine but if it’s for longer term purposes they could have you over a barrel soon."}
{"index":{"_index":"reddit"}}
{"title":"How do I create another website for a seperate branch?","body":"Hello, \n\nMy business is going pretty well at SuperDTF and I wanted to expand and get someone else doing this with me. I offered to buy my friend a printer, and all the supplies, and train him for 13% royalties on all sales. I wrote out a franchise agreement with a bunch of different stipulations but am a little out of my element here on how to have a website for him and I. He will be taking care of the San Diego County clients and online, and I will be dealing with Orange County and LA county. How do I create a website so that we are not overlapping but working together? Would I just create a subdomain like [www.sd.superdtf.com](https://www.sd.superdtf.com) or would I create a whole new website? ","url":"https://www.reddit.com/r/business/comments/14bcv4k/how_do_i_create_another_website_for_a_seperate/","comment":"Sounds like you could use the help of a lawyer"}
{"index":{"_index":"reddit"}}
{"title":"Michael Jordan agrees to sell majority ownership of Hornets","body":"Michael Jordan has agreed to sell his majority stake in the Charlotte Hornets to a group led by Gabe Plotkin and Rick Schnall for an approximately $3 billion valuation.","url":"https://www.nba.com/news/michael-jordan-selling-ownership-stake-hornets","comment":"He will make ten times return on his investment of $180 million."}
{"index":{"_index":"reddit"}}
{"title":"People who've spent big money on business seminars, was it worth it","body":"I've been to a few business seminars on different topics. Really only the first ones that are usually free. But one thing I see in common is a large push for additionalvery expensive seminars for more information. I assume they continue to push even more on people in those as well until the total cost ends up being greater than you'd spend getting a degree and actual coursework to practice opposed to just listening to hours of talking and hype.\n\n\nI can't help but think these people teaching how to be rich are just getting rich by the teaching seminars. In otherwords, most people won't share the same success.\n\nSo I'm curious if anyone here has been to these advanced courses, did you get your money's worth? Did you learn things you couldn't have learned in various books or a degree?","url":"https://www.reddit.com/r/business/comments/14bb97p/people_whove_spent_big_money_on_business_seminars/","comment":"I’ve bought a couple of courses after getting excited in a free seminar. My experience is that it is most definitely not worth the money. I believe you’re correct that these people mostly earn their money from selling courses. They teach you some and then ask for more money to teach you more. You will likely never feel satisfied and the more invested you get, the more you justify a larger price tag for the next course. Honestly, no hype seminar will beat years of focused work and making legitimate connections based on trust."}
{"index":{"_index":"reddit"}}
{"title":"Coffee shop in the Deep South","body":"Hi! I’ve worked in coffee my whole adult life, and I love it. I’ll be moving back to Mississippi, and at the forefront of my 5 year plan is to open my own coffee shop, or be well on my way there.\n\nI have no business background. I’m just a 20 something year old girl with a passion, who wants to bring something to my area that’s never been done before (ie, witchy, LGBT friendly community for teens and young adults who also need a safe space to escape from ultra religious and anti-gay family)\n\nWhere do I start? I have the vision, now I need the next steps.","url":"https://www.reddit.com/r/business/comments/14b8hlp/coffee_shop_in_the_deep_south/","comment":"/r/smallbusiness is a great place to ask this"}
{"index":{"_index":"reddit"}}
{"title":"Where Reddit went wrong and how to course-correct: a modest proposal","body":"In the process of trying to understand the current state of Reddit and what the future might bring, I found a very interesting post:\n\n[Spez on Reddit’s monetization](https://www.reddit.com/r/ModSupport/comments/xhuaqf/are_we_allowed_to_discuss_what_spez_brought_up_in/?utm_source=share\u0026utm_medium=ios_app\u0026utm_name=ioscss\u0026utm_content=2\u0026utm_term=1)\n\nI think this explains a lot about how unaware Reddit’s leadership of how the average user interacts with the platform. The post above describes a surreal and clumsy vision for Reddit, with users being “empowered” to barter goods both virtual and physical; where everyone can make money off of everyone else.\n\nThis seems akin to adding a world-class theater to your local Walmart. Maybe you build great acoustics and lightning, hire incredible actors, maybe the acts all receive glowing reviews from famous critics… It still wouldn’t work. \n\nThere are countless logistical problems to overcome due to the fact that Walmart was for many years not intended to house a theater, and that customers *are not prepared or interested in interacting with it in that way.*\n\nFor well over a decade, Reddit has been both an aggregate site and a valuable public forum. Reddit offers well-categorized information and the ability to banter with your fellow users about that information. Users who are insightful or funny are “rewarded” with thousands of upvotes and the occasional reward.\n\nThe structure that makes the most here is an advertising platform — something Reddit has classically been bad at. In part, this can be explained by a quote from Spez in the post above:\n\n*“Now one of the things that there's kind of a cultural thing on reddit that we have to kind of work through, which is kind of the anti-capitalist aspect of reddit. The purity of reddit.”*\n\nThe simple solution is to offer users incentive to occasionally interact with ads. **Imagine that you can browse Reddit with ads ON or OFF, but browsing with ads on earns you free awards.** Every impression delivered contributes to an account being able to redeem an award, and clicking into an ad or otherwise meeting some call to action contributes in a much, much greater way. Because interacting with other users is such a strong driving force, and awards allow you to interact with posts and comments in an exceptional way, the trade-off would make sense for many of Reddit’s users. \n\nReddit also shoots itself in the foot with overly-restrictive rules, especially in regards to self-promotion. Mention a project you’re working on, and even if it’s heavily upvoted, it will disappear if your account doesn’t meet the somewhat nebulous requirement that only 1/10th of your content can be self-promotion. Would-be advertisers hoping to make organic posts to gauge interest, or to help understand the culture of a particular subreddit, are driven away in an overzealous effort to make promotion almost exclusively a paid-for thing. In reality, more users would happily advertise on Reddit if they were given the opportunity to explore it a little without great financial risk. \n\nIn short, making ads a benign thing for Reddit’s audience seems much easier and more user-friendly than reimagining it as some warped, meme-y version of Etsy.\n\nI’m positing this with the slim hope that someone who is in the position to steer this platform right sees and acts on this simple bit of advice. Thank you to anyone who has taken the time to read this.","url":"https://www.reddit.com/r/business/comments/14b6tec/where_reddit_went_wrong_and_how_to_coursecorrect/","comment":"If you know what Modest Proposal refers to, you realize that this suggestion is about eating all the children who are taking up space on Reddit."}
{"index":{"_index":"reddit"}}
{"title":"Anyone here own a successful laundromat? I have always wanted to own one and would love to hear your story and thoughts behind this type of business.","body":"My husband and I have always said we would love to own a laundromat one day and, after purchasing several rental properties, I have started shifting my research towards acquiring a small business. They seem pretty self sufficient and low maintenance but I could be WAY wrong.  \nIf you do own one I would love to know how you got started and if you have any insights, pros, cons, horror stories you can share. TIA!","url":"https://www.reddit.com/r/business/comments/14b6jo8/anyone_here_own_a_successful_laundromat_i_have/","comment":"If you start accepting credits then you gotta start paying credit card fees which for a low price item can eat up a big chunk of change."}
{"index":{"_index":"reddit"}}
{"title":"Wanting to be rich with 17 and with no money","body":"Hi, so summer is about to begin and I will have more or less 3 months of holidays, I didn’t want to spend 3 months doing nothing, I was thinking to start making money but not with a job,  making a lot so I can leave school, there so many options that I found like marketing, making a business, investing…but I heard to lot of people that these things never works and won’t make you rich, and I never know what to do since lot of people says that those things never works, is there a way (THAT ACTUALLY WORKS) that can make me rich with 17 years old and starting with no money? I don’t care how hard and how much time it will take me, I will wait your answers and thank you for reading","url":"https://www.reddit.com/r/business/comments/14b6701/wanting_to_be_rich_with_17_and_with_no_money/","comment":"news flash, everyone wants to be rich using no money lol"}
{"index":{"_index":"reddit"}}
{"title":"How would someone monetize a newsletter business?","body":"I see a lot of people running newsletter businesses nowadays and was wondering how they monetize\n\ni know that some of them do paid ads, or paid subscription to the newsletter but what are the other ways?\n\npeople like sam parr who ran the hustle have sold their newsletter for millions of dollars with under 1 million subscribers\n\nwhat makes these subscribers so valuable? \n\ni run a [newsletter](https://www.theventurecanyon.com/) currently and was wondering how i could monetize it?\n\ni was thinking of doing this to start it off.\n\nAs a newsletter creator, I can choose to rely on donations from my subscribers or utilize crowdfunding platforms to generate revenue. I may offer a voluntary subscription model, allowing readers to contribute an amount of their choice to support the operations of my newsletter. This approach allows me to maintain a direct relationship with my audience and offer them the opportunity to support the content they value. By providing a voluntary subscription option, I give readers the freedom to decide the financial contribution they are comfortable with while still providing them with valuable content. These donations or contributions play a crucial role in sustaining the newsletter, covering expenses such as writing, editing, design, and distribution, and enabling me to continue providing high-quality content to my subscribers.\n\nwhat do you guys think?","url":"https://www.reddit.com/r/business/comments/14b5ic6/how_would_someone_monetize_a_newsletter_business/","comment":"Start a corresponding 503 and offer the opportunity to make a charitable donation through the purchase of a product for dual end revenue.  Pay yourself a salary from the 503.  Make sure you're altruistic about it.  Perhaps contact the IRS or an accountant for precise numbers."}
{"index":{"_index":"reddit"}}
{"title":"Building a dog park?","body":"\nI know most people are not all in agreement re: the safety and benefits of dog parks. But just for the sake of argument…\n\nDoes anyone know how a private citizen could propose and/or steamroll the idea of creating a public dog park in their town? \n\nIs it like a Leslie Knope “filling in the pit” type of pipe dream, or is it reasonably doable?\n\nThere’re no dog parks within an hour from where I live now, and I KNOW other people would utilize it, but I’ve never tried to do anything like this before.","url":"https://www.reddit.com/r/business/comments/14b1r6g/building_a_dog_park/","comment":"Prob gotta present it at a board meeting in your local township and gain public support and then somehow get the funding approved"}
{"index":{"_index":"reddit"}}
{"title":"Copywriting and video editing?","body":"I am currently looking into finding a job as I have just finished university and I want something that is location free so I can work from anywhere in the world.\n\nI have done copywriting work before and have also dabbled in video editing before with YouTube videos, school work etc.\n\nI keep seeing that these are high income skills but I struggle to see how I could really make a career out of it. \n\nObviously I see how video editing can be of value if you work for a content creator or studio producing entertaining material. But, i feel as if that’s after years or grinding and ultimately being lucky to work for someone or somewhere like that.\n\nHow could I make money from these skills and what is a lucrative direction to head in?\n\nAnything would help me out. \n\nThanks.","url":"https://www.reddit.com/r/business/comments/14ayjdh/copywriting_and_video_editing/","comment":"You could try freelancing. Something like social media management could incorporate both copywriting and video editing. You’ll also need to [download](https://www.movavi.com/imovie-for-windows/) the right tools for the job, like a quality video editor."}
{"index":{"_index":"reddit"}}
{"title":"Distributors","body":"We are an independent brand and we manufacture a unique products. We have distributors in several countries selling selected products of ours (they choose). Over the past few years, we have noted a slow decline in sales, possibly down to the cost of living issues, and other things, but I have a hunch that some of it may be down to our distributors.\n\nOur distributors usually choose their products and sell them but recently I've been feeling that this is having a negative impact on our business. Sure, you get a large order all at once, but the issue I am seeing is that those customers from abroad now don't come to us for that one product, but more damaging is, that they don't buy add on products with us as they normally would, to make it worthwhile for them buying from abroad, so it has a double impact.  \n\nI'm leaning on the idea of stopping all distributors so that the only place to buy our product is from us.\n\nThoughts please.","url":"https://www.reddit.com/r/business/comments/14ar0jy/distributors/","comment":"Answers here are impossible without knowing your market. \n\nThe reason to use a distributor is they have account reach and can administer orders \n\nIn that case, it’s cheaper for you to administer a few orders to a few accounts vs tons of orders to tons of accounts.  The distributors handle tons of accounts already so adding your product to their mix is not a big cost add.  \n\nIf you’ll be selling directly, you have to worry about administrative cost, and will be down one marketing partner.  \n\nGenerally, if you make this kind of decision, you need to know exactly why your sales are down and analyze costs/benefits of various strategies to boost sales.  \n\nDistributor X is no longer recommending our product.  Why?  What are they doing instead?  Is it better to improve your product/service, look for a new distributor, or go direct? \n\nCustomer X is no longer buying our product.  Why? \n\nHow do you compare to the competition? \n\nSpeak to people in your market, they will have more insight.  Interview your distributors.  Interview your customers.  Then you can make a more informed decision."}
{"index":{"_index":"reddit"}}
{"title":"small business ideas","body":"Hey guys, just started uni holidays and have been wanting to start a business. i think all the SEO dropshipping and affiliate marketing ideas are just way too crowded. Looking for something really simple and boring that no one is doing/ willing to do, which hopefully little capital is required to start up. car detailing has caught my eye, but any ideas would be greatly appreciated.","url":"https://www.reddit.com/r/business/comments/14aqmh6/small_business_ideas/","comment":"Selling bamboo clothing!!!"}
{"index":{"_index":"reddit"}}
{"title":"Are all business jobs boring?","body":"Are they all desk jobs where they sit around all day? Or do they do something fun as well?\n\nBy business jobs I mean things like Accounting, Finance, HR, Marketing, Sales etc.\n\nI want something fun to do.","url":"https://www.reddit.com/r/business/comments/14aq3e2/are_all_business_jobs_boring/","comment":"Work isn’t fun. That’s what it’s called work and not super happy fun time."}
{"index":{"_index":"reddit"}}
{"title":"A professor started tracking ‘Fortune 500 CEO colleges’ 20 years ago, and ‘the results were stunning.’","body":"\u003e Of the 500 CEOs on the list, seven or eight had no undergraduate degree, more than the combined degrees from any other college in the pool ... A fancy degree isn’t required for business success, and top-tier corporate executives usually don’t have elite educations.","url":"https://finance.yahoo.com/amphtml/news/professor-started-tracking-fortune-500-184223935.html","comment":"Saw this article yesterday, so silly. Yeah 8 people out of 500 don't have college degrees, that still means 99% do. Go to college, people"}
{"index":{"_index":"reddit"}}
{"title":"Popcorn Company","body":"Im 16 years old, I hate having a normal job so I set out to be an entrepenuer. I currently am looking to start a healthy snacking business. I plan to call it \"BopSnacks\" and start off with popcorn by calling it \"Bopcorn\" Sounds kinda corny right? but i think it would do well. I created a logo and a packaging design. I hired a web designer which is currently in the works. I did the math and It should be around 50 cents to make a bag. I really just want any advice I can get on this. On if its a good idea, any legal issues I may have. or anything like that. I didnt just start this out of the blue Ive been working on it for a couple months but school gets in the way and so does life. I really would rather kill myself then work a normal life. but thats besides the point. Any advice on it? I pretty much have all the basic things down as Ive had a profitable online business before. Was a clothing brand but now with all these wannabe virgil kids on tiktok I figured the best move was to close it down for this summer and let these kids die out while I work on something greater because lets be a honest a clothing brand isnt going to make me a million dollars. thanks for reading my long list of me rambling on but pretty much my question is Any advice on starting a popcorn company? Also before i get messages saying thats Illegal im pretty sure I should be fine with cottage food laws, i still have to do my research but thanks.","url":"https://www.reddit.com/r/business/comments/14amnm2/popcorn_company/","comment":"I'm impressed by your entrepreneurial mindset, and at such a young age, you don't only have experience but a good understanding of branding. However, you must not have closed your online store, in fact, you would have promoted that innovatively. What matters the most is the age of the brand, and you could have had an edge from that perspective. Newbies always come in businesses, all you have to do is stand out from the competition. \n\nMy advice is to relaunch your clothing brand if possible because you have experience, and this time, you won't be starting from scratch. However, you can go ahead with your popcorn idea, which is solid, later as a growth strategy for your company. Edible items have more stringent laws, and the perishibility factor makes it a bit challenging if you are not much connected with the industry."}
{"index":{"_index":"reddit"}}
{"title":"Alibaba founder Jack Ma is ‘alive’ and ‘happy,’ top exec says after China’s tech crackdown","body":"","url":"https://www.cnbc.com/2023/06/16/alibaba-founder-jack-ma-is-alive-and-happy-after-china-crackdown.html","comment":"As an AI language model, I don't have real-time information or the ability to browse the internet. As of my last knowledge update in September 2021, Jack Ma, the co-founder of Alibaba, was indeed alive. However, I cannot provide any information or updates beyond that point.\r  \n\r  \nIf there have been recent developments regarding Jack Ma's well-being or the state of China's tech crackdown, I recommend referring to trusted news sources or conducting an internet search for the most up-to-date information."}
{"index":{"_index":"reddit"}}
{"title":"Corporate boycotts clash with political reality","body":"","url":"https://www.reuters.com/breakingviews/corporate-boycotts-clash-with-political-reality-2023-06-15/","comment":"“WASHINGTON, June 15 (Reuters Breakingviews) - Republicans are firing from the hip when it comes to corporate boycotts. Conservative Americans’ changing beer habits may have contributed to Bud Light being pulled from its spot as the number one beer in the United States for the first time in more than two decades. But political boycotters could be shooting themselves in the foot.\n\n                         The trouble is that AB InBev's donations to Republican campaigns last year were quadruple what it gave to Democratic\n                                ones, according to OpenSecrets. \n\nConstellation Brands (STZ.N), which sells the beer that unseated Bud, more often backs Democrats. Target, meanwhile, also spent more on Republicans than Democrats in four of the last five years. As conservatives encourage consumption based on political views, they may in some cases pull cash from their own pockets.”"}
{"index":{"_index":"reddit"}}
{"title":"Financial Times: Hundreds of World Bank climate projects have no direct connection to climate, research finds","body":"","url":"https://www.ft.com/content/ba416b81-afa2-41be-aa3b-e86b8b3136e0","comment":"least surprising thing ever. these things are needed, but climate change is rife with grifters"}
{"index":{"_index":"reddit"}}
{"title":"Twitter sued for $250 million by music publishers over ‘massive’ copyright infringement","body":"","url":"https://www.theverge.com/2023/6/14/23761680/twitter-music-lawsuit-nmpa-copyright-infringement","comment":"Yes, I dislike Twitter, but I have no intention of cooperating with the goddamn NMPA."}
{"index":{"_index":"reddit"}}
{"title":"Finding the work life balance.","body":"Looking for any advice from micro/small business owners on how they manage the work life balance. \n\nYoung children and small business is a hard one to juggle. You want to spend more time with the family and the business suffers. You spend more time at work and you miss out on such valuable time with your family. \n\nHow do you guys do it, or how did you do it?","url":"https://www.reddit.com/r/business/comments/14a9k48/finding_the_work_life_balance/","comment":"I would agree, but I'm talking of a business starting from the ground up, and growing slowly, rather than one with big investment from the get go."}
{"index":{"_index":"reddit"}}
{"title":"The 11 companies that own everything","body":"","url":"https://i.redd.it/wnho8tpyra6a1.jpg","comment":"\"everything\" here is limited to consumable products, which is just a fraction of our overall economy"}
{"index":{"_index":"reddit"}}
{"title":"Arizona lawmakers have approved a bill in committee to promote research into the medical potential of psilocybin mushrooms for a variety of conditions, which could inform future reforms to more broadly allow access to psychedelic-assisted therapy.","body":"","url":"https://i.redd.it/jyczf2yokaia1.jpg","comment":"why does each state have to do this when science/medicine should be a unified movement?"}
{"index":{"_index":"reddit"}}
{"title":"Kill net neutrality and you’ll kill us, say 800 US startups","body":"","url":"http://www.theverge.com/2017/4/27/15447394/fcc-net-neutrality-roll-back-startups-letter-y-combinator","comment":"That's the whole point of why they are trying to get rid of net neutrality. It's so you can't compete with them."}
{"index":{"_index":"reddit"}}
{"title":"Employees Are Returning to the Office, Just to Sit on Zoom Calls","body":"","url":"https://www.bloomberg.com/news/articles/2022-04-01/employees-are-returning-to-office-post-covid-just-to-sit-on-zoom-calls?utm_content=business\u0026utm_source=facebook\u0026utm_campaign=socialflow-organic\u0026utm_medium=social\u0026cmpid=socialflow-facebook-business\u0026fbclid=IwAR1YDj9PYh5p1mYmdt0KuyngiDMyPBMabMH0m01k1J5Ev9Y7L7bfsvfdd8E\u0026fs=e\u0026s=cl","comment":"[deleted]"}
{"index":{"_index":"reddit"}}
{"title":"Patagonia Made $10 Million On Black Friday And Donated Every Cent To Save The Environment","body":"","url":"http://fiscalpost.com/2016/11/patagonia-made-10-million-black-friday-donated-every-cent-save-environment/","comment":"I did an exam on Patagonia for a final year business course. Their strategy and model is completely backwards, but it works. They do things like only create a product if they can do it environmentally friendly, bail you out of jail if you get arrested protesting, subsidise buying an electric car, have lifetime repair warranty (they prefer fixing your garment so they don't impact the environment more) and other cool initiatives. I now use their products and don't mind paying the premium for a good quality product from a good quality company. "}
{"index":{"_index":"reddit"}}
{"title":"First Warren Buffett TV Interview (1985)","body":"","url":"https://v.redd.it/8qo7vqakwg8a1","comment":"This isn't his first TV interview. There is a black and white one from his early 30s. He sounds exactly the same.\n\nEdit: https://youtu.be/cWMi5ZgDEh4"}
{"index":{"_index":"reddit"}}
{"title":"As metaverse land prices plummet, Mark Cuban says buying digital land is ‘The dumbest sh*t ever’","body":"","url":"https://fortune.com/2022/08/08/mark-cuban-criticizes-metaverse-land-sales-yuga-labs-otherside/","comment":"Land is valuable because there is a finite amount of it on this planet. That isn’t really the case in the metaverse."}
{"index":{"_index":"reddit"}}
{"title":"Getty Images is facing a $1 billion lawsuit for selling photos that were in the public domain","body":"","url":"http://qz.com/746255/photographer-files-1-billion-suit-against-getty-images-for-selling-photos-in-the-public-domain/","comment":"Getty once demanded £8,000 for a thumbnail on a site that we weren't even using.  I actually offered them £100 and they dropped their request to £4,000.  Then I told them to stop bothering me and they eventually went down to £800.  I told them if they didn't stop harassing me I would sue them for harassment and they eventually left me alone.  The sad thing is I saw in a lot of forums at the time that people had been scared into paying them.  I hope they get sued to fuck, they deserve it the dishonest bastards."}
{"index":{"_index":"reddit"}}
{"title":"Russian Stocks Are Nearly Worthless as Ukraine Sanctions Bite","body":"","url":"https://www.barrons.com/articles/russian-stocks-ukraine-sanctions-51646241831?mod=bol-social-fb\u0026fbclid=IwAR0O5Xp70FKesKwWDy0AWZDCOjOlNa2knM66vydGezG8qsWSsANo7Nv7ZIk","comment":"Imagine a russia…that only has Russian things for sale to its citizens… imagine their dealership lots, malls, phone stores, grocery stores, heck…imagine their social media and entertainment."}
{"index":{"_index":"reddit"}}
{"title":"Amazon is buying Whole Foods","body":"","url":"http://www.businesswire.com/news/home/20170616005338/en/Amazon-Acquire-Foods-Market","comment":"Bezos to his personal assistant: \"Alexa, pick me up some groceries.\"\n\n\n\nAssistant: \"OK, I just bought Whole Foods.\""}
{"index":{"_index":"reddit"}}
{"title":"Pharmaceutical Industry Suffers Billions In Losses After States Legalize Marijuana, New Study Finds","body":"","url":"https://www.marijuanamoment.net/pharmaceutical-industry-suffers-billions-in-losses-after-states-legalize-marijuana-new-study-finds/","comment":"Good"}
{"index":{"_index":"reddit"}}
{"title":"Target will keep stores closed on Thanksgiving for good. Target will no longer open its stores on Thanksgiving Day, making permanent a shift to the unofficial start of the holiday season that was suspended during the pandemic.","body":"","url":"https://www.cnbc.com/2021/11/22/target-will-keep-stores-closed-on-thanksgiving-for-good.html","comment":"After the shit year that most of us have had, good. Give retail workers a day away from hellish customers. Black Friday always brings out peoples’ worst anyways."}
{"index":{"_index":"reddit"}}
{"title":"Americans Fine With Paying More If Trading With Democracies, Not China","body":"","url":"https://www.forbes.com/sites/kenrapoza/2021/01/24/americans-fine-with-paying-more-if-trading-with-democracies-not-china/","comment":"Yet for some reason, Amazon makes it almost impossible to tell where a product was made.  Same with most other online retailers.  Is it really so hard to put the same label on a webpage that's already on the packaging?"}
{"index":{"_index":"reddit"}}
{"title":"SVB Chief Sold $3.6 Million in Stock Days Before Bank’s Failure","body":"","url":"https://www.bloomberg.com/news/articles/2023-03-10/svb-chief-sold-3-6-million-in-stock-days-before-bank-s-failure","comment":"Insider trading much? Time for the SEC to grow some balls"}
{"index":{"_index":"reddit"}}
{"title":"Salesforce has been reportedly paying Matthew McConaughey $10 million a year to act as a 'creative adviser' despite laying off 8,000 employees last month","body":"","url":"https://www.businessinsider.com/salesforce-reportedly-paying-mcconaughey-millions-despite-layoffs-2023-2","comment":"They keep getting laid off, and I stay the same wage.\n\nall right, all right, all right"}
{"index":{"_index":"reddit"}}
{"title":"Montana 2022 Cannabis Sales Eclipse $123 Million","body":"","url":"https://www.cannabisbusinesstimes.com/article/montana-adult-use-cannabis-sales-may-2022-trends/","comment":"Wow it's almost like Americans like smoking reefers"}
{"index":{"_index":"reddit"}}
{"title":"This is so true. The guy explains in minutes what is behind “the big resignation”.","body":"","url":"https://v.redd.it/sk5v5jk0ztl91","comment":"Longest way of explaining Maslow's hierarchy of needs."}
{"index":{"_index":"reddit"}}
{"title":"It Begins: WalMart Warns Truckers It Will No Longer Work With Them If They Move Goods For Amazon","body":"","url":"http://www.zerohedge.com/news/2017-06-28/it-begins-walmart-warns-truckers-it-will-no-longer-work-them-if-they-move-goods-amaz","comment":"I'd love to see the trucking companies telling Walmart to fuck off and going exclusive with Amazon."}
{"index":{"_index":"reddit"}}
{"title":"Doordash charges $16 for a $24 pizza, so the pizzeria bought its own pizzas and made money","body":"","url":"https://themargins.substack.com/p/doordash-and-pizza-arbitrage","comment":"So they were, making their own dough!!!\n\nHaha haha...\n\nI’ll let myself out..."}
